In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler, LabelEncoder, OneHotEncoder
import pickle

In [2]:
data = pd.read_csv('Churn_Modelling.csv')
data.sample(5)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
2903,2904,15728773,Hsieh,568,France,Female,47,7,0.00,2,1,1,45978.39,0
8203,8204,15588566,Wilkinson,778,Spain,Male,33,5,116474.28,2,1,1,32757.55,0
2222,2223,15763662,Longo,711,Germany,Male,43,2,39043.29,2,1,1,175423.69,0
2472,2473,15623196,Morley,686,France,Male,38,6,149238.97,1,1,1,97825.23,0
4741,4742,15605020,Schofield,651,France,Male,45,2,165901.59,2,1,0,23054.51,1

In [3]:
## Preprocessing the data
data.drop(columns=['RowNumber', 'CustomerId', 'Surname'], axis=1, inplace=True)

data.sample(5)

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
5089,688,Germany,Male,45,9,103399.87,1,0,0,129870.93,0
2492,520,Germany,Female,31,3,108914.17,1,1,1,183572.39,1
7375,639,France,Male,77,6,80926.02,2,1,1,55829.25,0
1352,535,Germany,Male,48,5,134542.73,1,1,1,58203.67,1
3937,761,France,Female,26,1,0.00,2,1,1,199409.19,0